Davidap041/ARM_Code_MSP432/Texas-MSP432-CCS/Peripherals_drivers/Drivers_MSP432.h
//*****************************************************************************
/*
 * \brief Essa fun��o tem o prop�sito Iniciar uma contagem a partir do clock principal
 * da CPU com objetivo de calcular o tempo de execu��o de instru��es entre o
 * Start_tick e o Stop_tick
 * obs1: A contagem � parada quando � chamada a fun��o Stop_tick();
 * obs2: O tempo m�ximo de entre as duas fun��es deve ser menor que 10 segundos
 * ou seja, essa fun��o mede o tempo de processamento at� 10 segundo, caso esse valor seja
 * ultrapassado (e a interrupt_on estiver habilitada) ser� mandado um printf indicando
 * o estouro do tempo medido
 *
 * \param None
 * \return Valor atual do Tick (Valor do in�cio da contagem)
 * O valor atual do Tick � (valor m�ximo de tick programado - n�mero de ticks at� o get)
 */
extern uint32_t DR_tick_start();
//*****************************************************************************
/*
 * \brief Essa fun��o tem o prop�sito Parar a contagem e calcular o tempo entre o Start
 * e o Stop
 * Quando a fun��o Stop_tick � chamada � calculado o tempo gasto entre o Start e Stop em
 * milisegundos e � "printado" na UART o valor correspondente
 * \param None
 * \return Valor de Ticks entre o Start e o Stop
 */
extern double DR_tick_stop(bool ultra_precision_mode);
//*****************************************************************************
/*
 * \brief Essa � a rotina de interrup��o pr� configurada que � chamado caso haja um estouro
 * da contagem
 */
extern void SysTick_Handler(void);
//*****************************************************************************
/*
 * \brief Essa fun��o tem o prop�sito incializar o T32 e configurar com o periodo entregue
 * por parametro "tempo_seg". Esse timer � aconselhado para itervalos grandes maior que 1 seg
 * o limite superior ainda n�o foi definido, e o arredondamento tamb�m n�o foi
 * mas o periodo da interrup��o pode ser calculada atrav�s de outra fun��o dr_T32_getPeriod_seg()
 * obs1: o T32 s� come�a acontar apartir da fun��o T32_start()
 * obs2: deve ser inicializada a interrup��o atrav�s da fun��o dr_T32_interrupt_init()
 * \param tempo_seg
 *           define o tempo em segundos que a fun��o ser� chamada.
 * \return noce
 */
extern void DR_t32_config_seg(uint_fast8_t n_Timer, float tempo_seg);
//*****************************************************************************
/*
 * This function start in T32 for start count
 * *obs1: o T32 deve ser incializado apartir das funcoes dr_T32_init_x antes do Start
 * *obs2: aconselha-se configurar a interrupcao antes do Start
 * param: none
 * return none
 */
extern void DR_t32_config_Hz(uint_fast8_t n_Timer, float freq_Hz);
extern void DR_t32_init(uint_fast8_t n_Timer);
//*****************************************************************************
/*
 * \brief Essa fun��o registra e habilita a interrup��o que ser� usada pelo T32
 * obs1: N�o esquecer de habilitar a interrup��o geral em dr_interrupt_on
 * \param void rotina(void)
 *       recebe a rotina de interrup��o que ser� chamada quando houver o estouro do
 *       T32 pr� configurado pelas fun��es dr_T32_init_x
 * \return none
 */
extern void DR_t32_interrupt_init(uint_fast8_t n_Timer, void rotina(void));
//*****************************************************************************
/*
 * \brief Essa fun��o retorna o valor exato que est� configurado a interrup��o
 * obs1: O principal uso dessa fun��o � para calcular o period configurado sem arredondamentos
 * e o periodo que foi realmente registrado com todos os truncamentos;
 * \param none
 * \return period
 *       retorna o valor do periodo registrado nos registrados internos do T32
 */
extern double DR_t32_getPeriod_seg(uint_fast8_t timer);
//*****************************************************************************
/*
 * \brief Essa fun��o retorna o valor exato que est� configurado a interrup��o
 * obs1: O principal uso dessa fun��o � para calcular o period configurado sem arredondamentos
 * e o periodo que foi realmente registrado com todos os truncamentos;
 * \param none
 * \return period
 *       retorna o valor de Frequ�ncia registrado nos registrados internos do T32
 */
extern double DR_t32_get_freq(uint_fast8_t timer);

extern void DR_i2c_pin();
extern void DR_i2c_config(uint_fast8_t n_I2C);
extern void DR_i2c_init(uint_fast8_t n_I2C);
extern void DR_i2c_read(uint_fast8_t n_I2C, uint8_t slaveAddr, uint8_t memAddr,
                        uint8_t *data);
extern void DR_i2c_write(uint_fast8_t n_I2C, uint8_t slaveAddr, uint8_t memAddr,
                         uint8_t data);
extern int DR_i2c_readraw(uint_fast8_t n_I2C, uint8_t slaveAddr,
                          uint8_t memAddr, uint8_t byteCount, uint8_t *data);
extern void DR_pmap_pin();
/*PWM functions*/
extern void DR_pwm_pin();
extern void DR_pwm_config(const dr_pwm_parameters *pwm_config);
extern void DR_pwm_init(dr_pwm_parameters *pwm_config,
                        uint_fast16_t pwm_init_duty);
extern float DR_pwm_getfreq(const dr_pwm_parameters *pwm_config);
extern float DR_pwm_getDuty_percent(dr_pwm_parameters *pwm_config);
extern inline uint16_t DR_pwm_getPeriod(dr_pwm_parameters *pwm_config);
extern inline void DR_PWM_setDuty(dr_pwm_parameters *pwm_config,
                                  uint_fast16_t pwm_duty);
extern inline uint16_t DR_pwm_getDuty(dr_pwm_parameters *pwm_config);
extern void _pwm_set_Prescaler(uint32_t timer, uint16_t timer_prescaler);
/*ADC functions*/
extern void DR_adc_pin();
extern void DR_adc_config();
extern void DR_adc_init();
extern void DR_adc_interrupt();